Repository: mtah/rbot
Catalog: po/*/rbot.po
Languages: sv_se

source: incorrect usage, ask for help using '%{command}'
sv_se: felaktig användning av kommandot, fråga efter hjälp med kommandot '%{command}'

source: %{count} core module loaded
sv_se: %{count} kärnmodul laddade

source: %{count} core module: %{list}
sv_se: %{count} kärnmodul: %{list}

source: no core botmodules loaded
sv_se: inga kärnmoduler laddade

source: %{count} plugin loaded
sv_se: %{count} insticksmodul laddad

source: %{count} plugin: %{list}
sv_se: %{count} insticksmodul: %{list}

source: %{highlight}%{count} plugin ignored%{highlight}
sv_se: %{highlight}%{count} insticksmodul ignorerad%{highlight}

source: %{highlight}%{count} plugin ignored%{highlight}: use %{bold}%{command}%{bold} to see why
sv_se: %{highlight}%{count} insticksmodul ignorerad%{highlight}: använd %{bold}%{command}%{bold} för att visa orsaken

source: %{highlight}%{count} plugin failed to load%{highlight}
sv_se: %{highlight}%{count} insticksmodul misslyckades vid laddning%{highlight}

source: %{highlight}%{count} plugin failed to load%{highlight}: use %{bold}%{command}%{bold} to see why
sv_se: %{highlight}%{count} insticksmodul misslyckades vid inladdning%{highlight}: använd %{bold}%{command}%{bold} för att se varför

source: no plugins failed to load
sv_se: inga insticksmoduler misslyckades vid inladdning

source: %{highlight}%{plugin}%{highlight} in %{dir} failed with error %{exception}: %{reason}
sv_se: %{highlight}%{plugin}%{highlight} i %{dir} misslyckades vid inladdningen med felet %{exception}: %{reason}

source: at %{backtrace}
sv_se: vid %{backtrace}

source: no plugins were ignored
sv_se: inga insticksmoduler ignorerades

source: overruled by previous
sv_se: överskriven av föregående

source: upgrading old-style (rbot 0.9.5 or earlier) plugin registry to new format
sv_se: uppgraderar gammaldags (rbot 0.9.5 eller tidigare) insticksmodulsregister till nytt format

source: upgrading previous (rbot 0.9.9 or earlier) plugin registry to new split format
sv_se: uppgraderar föregående (rbot 0.9.9 eller tidigare) insticksmodulsregister till nytt format

source: marshal recovery failed, trying default
sv_se: marshal-återställning misslyckades, försöker med vanlig
