Repository: mtah/rbot
Catalog: po/*/rbot.po
Languages: sv_se

source: Password for the bot owner
sv_se: Lösenord för botägaren

source: Set false to prevent new botusers from logging in without a password when the user netmask is known
sv_se: Sätt till "false" för att förhindra nya botanvändare från att logga in utan lösenord när användarens nätmask är känd

source: Set false to prevent new botusers from recognizing IRC users without a need to manually login
sv_se: Sätt till false för att förhindra nya botanvändare att känna igen IRC-användare utan att logga in manuellt

source: Set true to allow new botusers to be created automatically
sv_se: Sätt till "true" för att tillåta nya botanvändare att skapas automatiskt

source: %{user}, you don't have '%{command}' permissions here
sv_se: %{user}, du har inte rättigheter att utföra kommandot '%{command}' här

source: %{desc} [valid values are: %{values}]
sv_se: %{desc} [giltiga värden: %{values}]

source: First time rbot configuration wizard
sv_se: Konfigurationsguide vid första uppstarten av rbot

source: This wizard will ask you a few questions to get you started.
sv_se: Denna guide kommer be dig att svara på några frågor för att komma igång.

source: The rest of rbot's configuration can be manipulated via IRC once rbot is connected and you are auth'd.
sv_se: Den resterande konfigurationen av rbot kan genomföras via IRC när rbot väl är ansluten och du är autentiserad.

source: please do not use + or - in front of command %{command} when resetting
sv_se: Vänligen använd ej + eller - framför kommandot %{command} vid återställning

source: + or - expected in front of %{string}
sv_se: + eller - förväntades framför %{string}

source: '%{string}' doesn't look like a channel name
sv_se: '%{string}' verkar inte vara ett kanalnamn

source: trailing comma
sv_se: efterföljande kommatecken

source: you probably forgot a comma
sv_se: du glömde antagligen ett kommatecken

source: couldn't find botuser %{name}
sv_se: kunde ej hitta botanvändaren %{name}

source: you can't change permissions for %{username}
sv_se: du kan inte ändra rättigheterna för %{username}

source: couldn't satisfy your request: %{errors}
sv_se: kunde inte slutföra åtgärden: %{errors}

source: you are owner, you can do anything
sv_se: du är ägaren och kan göra vad som helst

source: owner can do anything
sv_se: ägaren kan göra vad som helst

source: on any channel:
sv_se: i valfri kanal:

source: in private:
sv_se: privat:

source: no permissions set for %{user}
sv_se: inga rättigheter satt för användaren %{user}

source: permissions for %{user}:: %{permissions}
sv_se: rättigheter för %{user}:: %{permissions}

source: . only %{max} will be shown
sv_se: . endast %{max} kommer att visas

source: %{count} commands found matching %{pattern}%{extra}
sv_se: %{count} kommandon matchade %{pattern}%{extra}

source: %{user} can already do that
sv_se: %{user} kan redan göra det

source: %{user} can't do that already
sv_se: %{user} kan inte göra det än

source: sorry, %{cmd} doesn't look like a valid command. maybe you misspelled it, or you need to specify it should be in private?
sv_se: tyvärr, %{cmd} verkar inte vara ett giltigt kommando. du kanske har stavat fel eller så behöver du specificera att det skall vara privat?

source: welcome, %{user}
sv_se: välkommen, %{user}

source: sorry, can't do
sv_se: tyvärr, det kan jag inte göra

source: couldn't login: %{exception}
sv_se: kunde inte logga in: %{exception}

source: I couldn't find anything to let you login automatically
sv_se: Kunde inte hitta något som låter dig logga in automatiskt

source: you are %{who}
sv_se: du är %{who}

source: no one that I know
sv_se: ingen som jag känner till

source: my boss
sv_se: min chef

source: login [<botuser>] [<pass>]: logs in to the bot as botuser <botuser> with password <pass>. When using the full form, you must contact the bot in private. <pass> can be omitted if <botuser> allows login-by-mask and your netmask is among the known ones. if <botuser> is omitted too autologin will be attempted
sv_se: login [<botuser>] [<pass>]: loggar in på boten som botanvändaren <botuser> med lösenordet <pass>. Vid användandet av den fullständiga formen måste du kontakta boten privat. <pass> kan utelämnas om <botuser> tillåter login-by-mask och din nätmask är känd. om även <botuser> utelämnas görs ett försök till automatisk inloggning

source: whoami: names the botuser you're linked to
sv_se: whoami: namnger botanvändaren som du är länkad till

source: who is <user>: names the botuser <user> is linked to
sv_se: who is <user>: namnger botanvändaren som <user> är länkad till

source: a permission is specified as module::path::to::cmd; when you want to enable it, prefix it with +; when you want to disable it, prefix it with -; when using the +reset+ command, do not use any prefix
sv_se: en rättighet specificeras som modul::sökväg::till::kommando; när du vill aktivera en rättighet, använd prefixet +; när du vill avaktivera en rättighet, använd prefixet -; använd ej några prefix tillsammans med kommandot +reset+

source: permissions [re]set <permission> [in <channel>] for <user>: sets or resets the permissions for botuser <user> in channel <channel> (use ? to change the permissions for private addressing)
sv_se: permissions [re]set <permission> [in <channel>] for <user>: sätter eller återställer rättigheterna för botanvändaren <user> i kanalen <channel> (använd ? fär att ändra rättigheterna för privat adressering)

source: permissions view [for <user>]: display the permissions for user <user>
sv_se: permissions view [for <user>]: visar rättigheterna för användaren <user>

source: permissions search <pattern>: display the permissions associated with the commands matching <pattern>
sv_se: permissions search <pattern>: visar rättigheterna associerade med de kommandon som matchar <pattern>

source: permission topics: syntax, (re)set, view, search
sv_se: ämnen för permission: syntax, re(set), view, search

source: user show <what> : shows info about the user; <what> can be any of autologin, login-by-mask, netmasks
sv_se: user show <what> : visar information om användaren; <what> kan vara en utav följande: autologin, login-by-mask, netmasks

source: user enable|disable <what> : turns on or off <what> (autologin, login-by-mask)
sv_se: user enable|disable <what> : aktiverar/avaktiverar <what> (autologin, login-by-mask)

source: user set password <blah> : sets the user password to <blah>; passwords can only contain upper and lowercase letters and numbers, and must be at least 4 characters long
sv_se: user set password <blah> : sätter användarens lösenord till <blah>; lösenord kan endast innehålla stor och små bokstäver samt siffror och måste vara minst 4 karaktärer långa

source: user add|rm netmask <mask> : adds/removes netmask <mask> from the list of netmasks known to the botuser you're linked to
sv_se: user add|rm netmask <mask> : lägger till/tar bort nätmask <mask> från listan av kända nätmasker för botanvändaren du är länkad till

source: user reset <what> : resets <what> to the default values. <what> can be +netmasks+ (the list will be emptied), +autologin+ or +login-by-mask+ (will be reset to the default value) or +password+ (a new one will be generated and you'll be told in private)
sv_se: user reset <what> : återställer <what> till standardvärdet. <what> kan vara +netmasks+ (listan töms), +autologin+, +login-by-mask+ eller +password+ (ett nytt lösenord genereras och skickas till dig privat)

source: user tell <who> the password for <botuser> : contacts <who> in private to tell him/her the password for <botuser>
sv_se: user tell <who> the password for <botuser> : kontaktar <who> privat och meddelar lösenordet för <botuser>

source: user create <name> <password> : create botuser named <name> with password <password>. The password can be omitted, in which case a random one will be generated. The <name> should only contain alphanumeric characters and the underscore (_)
sv_se: user create <name> <password> : skapar en botanvändare kallad <name> med lösenordet <password>. Lösenordet kan utelämnas, varvid användarens lösenord slumpgenereras. Användarnamnet <name> bör endast innehålla karaktärer och understreck (_)

source: user list : lists all the botusers
sv_se: user list : listar alla botanvändare

source: user destroy <botuser> : destroys <botuser>. This function %{highlight}must%{highlight} be called in two steps. On the first call <botuser> is queued for destruction. On the second call, which must be in the form 'user confirm destroy <botuser>', the botuser will be destroyed. If you want to cancel the destruction, issue the command 'user cancel destroy <botuser>'
sv_se: user destroy <botuser> : raderar användaren <botuser>. Denna funktion %{highlight}måste%{highlight} anropas i två steg. Vid det första anropet placeras <botuser> i kö för radering. Vid det andra anropet, som måste vara på formen 'user confirm destroy <botuser>', kommer användaren att raderas. Om du vill avbryta raderingen, ge kommandot 'user cancel destroy <botuser>'

source: user topics: show, enable|disable, add|rm netmask, set, reset, tell, create, list, destroy
sv_se: ämnen för user: show, enable|disable, add|rm netmask, set, reset, tell, create, list, destroy

source: auth <masterpassword>: log in as the bot owner; other commands: login, whoami, permissions syntax, permissions [re]set, permissions view, user, meet, hello, allow, prevent
sv_se: auth <masterpassword>: logga in som botägaren; övriga kommandon: login, whoami, permissions syntax, permissions [re]set, permissions view, user, meet, hello, allow, prevent

source: meet <nick> [as <user>]: creates a bot user for nick, calling it user (defaults to the nick itself)
sv_se: meet <nick> [as <user>]: skapar en botanvändaren för smeknamnet <nick> kallad <user> (standardvärdet för <user> är angivet smeknamn)

source: hello: creates a bot user for the person issuing the command
sv_se: hello: skapar en botanvändare för personen som ger kommandot

source: allow <user> to do <sample command> [<where>]: gives botuser <user> the permissions to execute a command such as the provided sample command (in private or in channel, according to the optional <where>)
sv_se: allow <user> to do <sample command> [<where>]: ger botanvändaren <user> rättigheterna att anropa det angivna kommandot <sample command> (antingen privat eller i kanal, enligt den frivilliga parametern <where>)

source: deny <user> from doing <sample command> [<where>]: removes from botuser <user> the permissions to execute a command such as the provided sample command (in private or in channel, according to the optional <where>)
sv_se: deny <user> from doing <sample command> [<where>]: raderar rättigheterna för botanvändaren <user> att anropa det angivna kommandot <sample command> (privat eller i kanal, enligt den frivilliga parametern <where>)

source: auth commands: auth, login, whoami, who, permission[s], user, meet, hello, allow, deny
sv_se: auth-kommandon: auth, login, whoami, who, permission[s], user, meet, hello, allow, deny

source: sorry, I need more arguments to %{command}
sv_se: ursäkta, jag behöver fler argument till %{command}

source: I can only %{command} these: %{arguments}
sv_se: Jag kan enbart %{command} dessa: %{arguments}

source: no such bot user %{user}
sv_se: %{user} är ingen botanvändare

source: you can't mess with %{user}
sv_se: du kan inte modifiera %{user}

source: you can't see the properties of %{user}
sv_se: du kan inte visa egenskaperna hos %{user}

source: no way I'm telling you the master password!
sv_se: inte en chans att jag ger dig huvudlösenordet!

source: you can't ask for someone else's password
sv_se: du kan inte fråga efter någon annans lösenord

source: c'mon, you can't be asking me seriously to tell you the password in public!
sv_se: kom igen, du kan väl inte seriöst be mig att visa lösenordet offentligt!

source: the password for %{user} is %{password}
sv_se: lösenordet för %{user} är %{password}

source: can %{action}
sv_se: kan %{action}

source: can not %{action}
sv_se: kan inte %{action}

source: knows no netmasks
sv_se: känner inte till några nätmasker

source: knows %{netmasks}
sv_se: känner till %{netmasks}

source: you can't change the default user
sv_se: du kan inte växla standardanvändaren

source: you can't edit %{user}
sv_se: du kan inte redigera %{user}

source: I ignored %{things} because %{reason}
sv_se: Jag ignorerade %{things} eftersom %{reason}

source: I haven't changed anything
sv_se: Jag har inte ändrat något

source: is that a joke? setting the password in public?
sv_se: är det ett skämt? att sätta lösenordet offentligt?

source: the password for %{user} is now %{password}
sv_se: lösenordet för %{user} är nu %{password}

source: I can only add/remove netmasks. See +help user add+ for more instructions
sv_se: Jag kan bara lägga till/ta bort nätmasker. See +help user add+ för ytterligare instruktioner

source: sorry, I don't know how to %{request}
sv_se: tyvärr, jag kan inte &{request}

source: couldn't %{cmd}: %{exception}
sv_se: kunde inte %{cmd}: %{exception}

source: you are now registered as %{buname}. I created a random password for you : %{pass} and you can change it at any time by telling me 'user set password <password>' in private
sv_se: du är nuy registrerad som %{buname}. Jag har skapat ett slumpgenererat lösenord för dig: %{pass} och du kan ändra det vid valfri tidpunkt genom att ge kommandot 'user set password <password>' privat

source: but I already know %{buname}
sv_se: men jag känner redan till %{buname}

source: I had problems meeting %{nick}: %{e}
sv_se: Jag fick problem med att möta %{nick}: %{e}

source: couldn't find botuser %{user}
sv_se: kunde inte hitta botanvändaren %{user}

source: I'm not telling the master password to anyone, pal
sv_se: Jag berättar inte huvudlösenordet för någon, kompis

source: the password for botuser %{user} is %{password}
sv_se: lösenordet för botanvändaren %{user} är %{password}

source: I told %{user} that %{message}
sv_se: Jag berättade för %{user} att %{message}

source: are you nuts, creating a botuser with a publicly known password?
sv_se: skapa en botanvändare med ett offentligen känt lösenord - är du galen?

source: failed to create %{user}: %{exception}
sv_se: misslyckades med att skapa %{user}: %{exception}

source: created botuser %{user}
sv_se: skapade botanvändaren %{user}

source: (queued for destruction)
sv_se: (kölagd för radering}

source: I have no botusers other than the default ones
sv_se: Jag har inga andra botanvändare än standardanvändarna

source: You can't destroy %{user}
sv_se: Du kan inte radera %{user}

source: no such botuser %{user}
sv_se: det finns ingen botanvändare med namnet %{user}

source: %{user} removed from the destruction queue
sv_se: %{user} borttagen från raderingskön

source: %{user} was not queued for destruction
sv_se: %{user} kölagdes ej för radering

source: %{user} already queued for destruction, use %{highlight}user confirm destroy %{user}%{highlight} to destroy it
sv_se: %{user} redan kölagd för radering, använd %{highlight}user confirm destroy %{user}%{highlight} för att radera användaren

source: %{user} queued for destruction, use %{highlight}user confirm destroy %{user}%{highlight} to destroy it
sv_se: %{user} kölagd för radering, använd %{highlight}user confirm destroy %{user}%{highlight} för att radera användaren

source: %{user} is not queued for destruction yet
sv_se: %{user} är inte kölagd för radering än

source: failed: %{exception}
sv_se: misslyckades: %{exception}

source: botuser %{user} destroyed
sv_se: botanvändaren %{user} raderad

source: please don't touch the default users
sv_se: vänligen rör ej standardanvändarna

source: no such botuser %{source}
sv_se: ingen botanvändare %{source}

source: botuser %{dest} exists already
sv_se: botanvändaren %{dest} existerar redan

source: botuser %{source} copied to %{dest}
sv_se: botanvändaren %{source} kopierades till %{dest}

source: botuser %{source} renamed to %{dest}
sv_se: botanvändaren %{source} döptes om till %{dest}

source: selecting data to export ...
sv_se: väljer data att exportera ...

source: preparing data for export ...
sv_se: förbereder data för export ...

source: failed to prepare data: %{exception}
sv_se: misslyckades med att förbereda data: %{exception}

source: exporting to %{file} ...
sv_se: exporterar till %{file} ...

source: failed to export users: %{exception}
sv_se: misslyckades med att exportera användare : %{exception}

source: done
sv_se: klart

source: reading %{file} ...
sv_se: läser %{file} ...

source: failed to import from: %{exception}
sv_se: misslyckades med att importera från: %{exception}

source: selecting data to import ...
sv_se: väljer data att importera ...

source: parsing data from import ...
sv_se: parsar data från import ...

source: failed to parse data: %{exception}
sv_se: misslyckades med att parsa data: %{exception}

source: quit [<message>] => quit IRC with message <message>
sv_se: quit [<message>] => avsluta IRC med meddelandet <message>

source: restart => completely stop and restart the bot (including reconnect)
sv_se: restart => komplett avstängning och omstart av boten (inklusive återanslutning)

source: part
sv_se: lämna

source: hide => part all channels
sv_se: hide => lämna alla kanaler

source: say <channel>|<nick> <message> => say <message> to <channel> or in private message to <nick>
sv_se: say <channel>|<nick> <message> => säg <message> i <channel> eller i privat meddelande till <nick>

source: action <channel>|<nick> <message> => does a /me <message> to <channel> or in private message to <nick>
sv_se: action <channel>|<nick> <message> => utför en /me <message> i <channel> eller i ett privat meddelande till <nick>

source: quiet [in here|<channel>] => with no arguments, stop speaking in all channels, if "in here", stop speaking in this channel, or stop speaking in <channel>
sv_se: quiet [in here|<channel>] => utan argument: sluta tala i alla kanaler."in here" ber boten att sluta tala i aktuell kanal. För att tysta boten i en viss kanal, använd parametern <channel>

source: talk [in here|<channel>] => with no arguments, resume speaking in all channels, if "in here", resume speaking in this channel, or resume speaking in <channel>
sv_se: talk [in here|<channel>] => utan argument: återuppta meddelandeaktiviteten i alla kanaler. "in here" instruerar boten att återuppta aktiviteten i aktuell kanal. För att återuppta aktivitet i en viss kanal, använd parametern <channel>

source: ping => replies with a pong
sv_se: ping => svarar med ett pong

source: mode <channel> <mode> <nicks> => set channel modes for <nicks> on <channel> to <mode>
sv_se: mode <channel> <mode> <nicks> => sätter kanallägen för <nicks> i <channel> till <mode>

source: [%{secs} ago]
sv_se: [%{secs} sedan]

source: I'm a v. %{version}%{ago} rubybot%{copyright}%{url}
sv_se: Jag är en v. %{version}%{ago} rubybot%{copyright}%{url}

source: no such module %{module}
sv_se: ingen modul med namnet %{module}

source: no such config key %{key}
sv_se: ingen konfigurationsnyckel med namnet %{key}

source: no config key found matching %{r}
sv_se: ingen konfigurationsnyckel matchade %{r}

source: possible keys: %{kl}
sv_se: möjliga nycklar: %{kl}

source: this config change will take effect on the next restart
sv_se: denna konfigurationsändring kommer att träda i kraft vid nästa omstart

source: this config change will take effect on the next rescan
sv_se: denna konfigurationsändring kommer att ta effekt vid nästa rescan

source: failed to set %{key}: %{error}
sv_se: misslyckades med att sätta %{key}: %{error}

source: config key %{key} is not an array
sv_se: konfigurationsnyckeln %{key} är inte en array

source: failed to add %{value} to %{key}: %{error}
sv_se: misslyckades med att lägga till %{value} i %{key}: %{error}

source: failed to remove %{value} from %{key}: %{error}
sv_se: misslyckades med att ta bort %{value} från %{key}: %{error}

source: saving ...
sv_se: sparar ...

source: rescanning ...
sv_se: utför rescan ...

source: done. %{plugin_status}
sv_se: klar. %{plugin_status}

source: config list => list configuration modules, config list <module> => list configuration keys for module <module>
sv_se: config list => lista konfigurationsmoduler, config list <module> => lista konfigurationsnycklar för modulen <module>

source: config get <key> => get configuration value for key <key>
sv_se: config get <key> => hämta konfigurationsvärde för nycklen <key>

source: reset key <key> to the default
sv_se: återställ nyckeln <key> till sitt ursprungsvärde

source: config set <key> <value> => set configuration value for key <key> to <value>
sv_se: config set <key> <value> => sätt konfigurationsvärdet för nyckeln <key> till <value>

source: config desc <key> => describe what key <key> configures
sv_se: config desc <key> => beskriv vad <key> konfigurerar

source: config add <value> to <key> => add value <value> to key <key> if <key> is an array
sv_se: config add <value> to <key> => lägg till värdet <value> till nyckeln <key> om <key> är en array

source: config rm <value> from <key> => remove value <value> from key <key> if <key> is an array
sv_se: config rm <value> from <key> => ta bort värdet <value> från key <key> om <key> är en array

source: config module - bot configuration. usage: list, desc, get, set, unset, add, rm
sv_se: modulen config - botkonfigurering. användning: list, desc, get, set, unset, add, rm

source: nick <newnick> => change the bot nick to <newnick>, if possible
sv_se: nick <newnick> => ändra botens smeknamn till <newnick> om möjligt

source: status => display some information on the bot's status
sv_se: status => visa lite information om botens status

source: rescan => reload modules and static facts
sv_se: rescan => ladda om moduler och statiska fakta

source: version => describes software version
sv_se: version => beskriver mjukvarans version

source: config-related tasks: config, save, rescan, version, nick, status
sv_se: config-relaterade åtgärder: config, save, rescan, version, nick, status

source: no filters in group %{g}
sv_se: inga filter i gruppen %{g}

source: no known filters
sv_se: inga kända filter

source: known filters:
sv_se: kända filter:

source: no known filter groups
sv_se: inga kända filtergrupper

source: known filter groups:
sv_se: kända filtergrupper:

source: no filters match %{pat}
sv_se: inga filter matchar %{pat}

source: filters matching %{pat}:
sv_se: filter som matchar %{pat}:

source: %{key} data for %{user}: %{data}
sv_se: %{key}-data för %{user}: %{data}

source: sorry, no %{key} data for %{user}
sv_se: tyvärr, ingen %{key}-data för %{user}

source: year
sv_se: år

source: years
sv_se: år

source: month
sv_se: månad

source: months
sv_se: månader

source: day
sv_se: dag

source: days
sv_se: dagar

source: hour
sv_se: timme

source: hours
sv_se: timmar

source: minute
sv_se: minut

source: minutes
sv_se: minuter

source: second
sv_se: sekund

source: seconds
sv_se: sekunder

source: and
sv_se: och

source: %{d} from now
sv_se: om %{d}

source: %{d} ago
sv_se: för %{d} sen

source: on %{date}
sv_se: den %{date}

source: less than a minute
sv_se: mindre än en minut

source: %{m} minutes
sv_se: %{m} minuter

source: about one hour
sv_se: ungefär en timme

source: %{m} hours
sv_se: %{m} timmar

source: one day
sv_se: en dag

source: about one day
sv_se: ungefär en dag

source: %{m} days
sv_se: %{m} dagar

source: help topics:
sv_se: hjälpämnen:

source: (help <topic> for more info)
sv_se: (help <topic> för mer information)

source: no help for topic %{topic}
sv_se: ingen hjälpinformation för ämnet %{topic}

source: Uptime %{up}, %{plug} plugins active, %{sent} lines sent, %{recv} received.
sv_se: Uptime %{up}, %{plug} insticksmoduler aktiva, %{sent} rader skickade, %{recv} mottagna.
